#! /bin/bash
#####################################################################
#   目的：显示时间戳对应的可读日期
#####################################################################

#############################
# Function
#############################

# 功能：输出 命令使用说明
# 参数：无
# 返回：无
function Usage() {
    echo "Usage: $(readlink -f $0) timestap ... "
    # exit status, 2 means Incorrect Usage
    exit 2
}

# 功能：显示时间戳对应的可读日期
# 参数：时间戳
# 返回：可读日期
function SayTimeStap() {
    date -d "@$1" +"%Y/%m/%d %H:%M:%S" 2>&1
}

##################################
# Execute
##################################

if [ $# -eq 0 ]; then
    Usage
else
    for param in $@; do
        echo "-------------------------------"
        echo "<$param> "$(SayTimeStap $param)
    done
fi
